[
  {
    "id": 1,
    "name": "Green Haven Nursery",
    "shortDescription": "A modern, full-featured online nursery e-commerce platform",
    "description": "🌿 GreenHaven E-commerce Platform\n\nGreenHaven is a modern e-commerce platform designed for plant enthusiasts and nurseries, providing a seamless shopping experience for customers and powerful management tools for administrators.\n\n🚀 Features Overview\n\n🛍️ Customer Features\n\nProduct Browsing: Explore a wide variety of plants with advanced filtering and search capabilities for easy discovery.\n\nShopping Cart: Add or remove items with real-time inventory checks to ensure availability.\n\nSecure Checkout: Enjoy flexible payment options, including Cash on Delivery and Stripe integration for secure transactions.\n\nOrder Tracking: Monitor order status in real time, from placement to delivery.\n\nResponsive Design: Optimized interface ensures a smooth experience on desktop, tablet, and mobile devices.\n\nProduct Details: Comprehensive product pages feature high-quality images and detailed care instructions to help customers make informed decisions.\n\n👨‍💼 Admin Features\n\nProduct Management: Perform full CRUD (Create, Read, Update, Delete) operations on products directly from the admin panel.\n\nCategory Management: Organize products into customizable categories for better browsing and inventory organization.\n\nOrder Management: Track and update order statuses, providing customers with timely updates.\n\nImage Upload: Bulk upload product images with drag-and-drop support, simplifying catalog management.\n\nInventory Tracking: Monitor stock levels in real time to prevent overselling and ensure accurate availability.\n\nAnalytics Dashboard: Gain insights into sales performance and inventory trends with an intuitive analytics dashboard.\n\n✨ Why GreenHaven?\nGreenHaven streamlines the online plant shopping experience while empowering nursery owners with robust tools for managing products, orders, and inventory. Built with modern technologies, it combines exceptional user experience with reliable backend operations to support growing businesses.\n\nWould you like a shorter summary for use in social media or a resume bullet point?",
    "thumbnail": "/project111.png?height=300&width=400",
    "images": ["/project111.png?height=600&width=800", "/project112.png?height=600&width=800", "/placeholder.svg?height=600&width=800"],
    "techStack": ["Next.js", "TypeScript", "Tailwind CSS", "MongoDB", "Vercel", "Javascript", "Node.js", "Express"],
    "liveUrl": "https://green-haven-nursary.vercel.app/",
    "githubUrl": "https://github.com/AR-Raju/green-haven-nursary",
    "featured": true,
    "status": "Live",
    "startDate": "2025-06-01",
    "endDate": "2025-07-01"
  },
  {
    "id": 2,
    "name": "Sports Facility Booking Platform",
    "shortDescription": "A modern booking platform focused on sports and insights",
    "description": "This platform is a comprehensive facility booking and management system with secure JWT-based authentication and role-based access control.\nUsers can browse facilities, check real-time availability, and manage bookings through an intuitive dashboard.\nAdmins have full control over facilities, bookings, and platform settings, with advanced analytics for insights.\nIntegrated SSLCommerz ensures secure payment processing, complete with payment history and refund management.\nThe system includes interactive booking, cancellation policies, image uploads, and detailed facility information for a seamless experience.",
    "thumbnail": "/project113.png?height=300&width=400",
    "images": ["/project113.png?height=600&width=800", "/project114.png?height=600&width=800"],
    "techStack": ["Next.js", "React", "Tailwind CSS", "Javascript", "Vercel"],
    "liveUrl": "https://sports-facility-client-sand.vercel.app/",
    "githubUrl": "https://github.com/AR-Raju/sports-facility-client",
    "featured": true,
    "status": "In Development",
    "startDate": "2025-03-01",
    "endDate": null
  },
  {
    "id": 3,
    "name": "Protocol",
    "shortDescription": "A documenation and project sturcture site",
    "description": "This is a documentation and project structure site designed to provide a comprehensive overview of the Protocol project. It includes detailed information about the project's architecture, features, and usage guidelines. The site is built using modern web technologies to ensure a responsive and user-friendly experience.",
    "thumbnail": "/project115.png?height=300&width=400",
    "images": ["/project115.png?height=600&width=800"],
    "techStack": ["Next.js", "Javascript", "Tailwind CSS", "Vercel"],
    "liveUrl": "https://crafting-documentation-bugn.vercel.app/",
    "githubUrl": "https://github.com/AR-Raju/crafting-documentation",
    "featured": false,
    "status": "In Development",
    "startDate": "2023-06-01",
    "endDate": null
  },
  {
    "id": 4,
    "name": "Task Management App",
    "shortDescription": "Collaborative task management application with real-time updates",
    "description": "A modern task management application that enables teams to collaborate effectively. Features include project creation, task assignment, progress tracking, real-time notifications, and team communication. The app supports multiple project views including Kanban boards, list view, and calendar integration.",
    "thumbnail": "/placeholder.svg?height=300&width=400",
    "images": ["/placeholder.svg?height=600&width=800", "/placeholder.svg?height=600&width=800"],
    "techStack": ["Next.js", "TypeScript", "Prisma", "PostgreSQL", "Socket.io"],
    "liveUrl": "#",
    "githubUrl": "https://github.com/asikur/task-manager",
    "featured": false,
    "status": "Completed",
    "startDate": "2023-01-01",
    "endDate": "2023-05-01"
  }
]
